{
  "Version": "030",
  "Year": "2024",
  "Semester": "Spring",
  "project_name": "U.S Sheltered Companion Animals Data Analysis",
  "Objective": " \n            Based on the record of National Council on Pet Population Study and Policy (NCPPSP) and the American Society for the Prevention of Cruelty to Animals (ASPCA), \n            each year U.S. animal shelters receive around 6.5 million companion animals and approximately 1.5 million of them will face euthanasia. \n            The primary goal of this project is to dig into animal adoption data, boost public awareness about animal care, and aim to bring down the high euthanasia rates in U.S. animal shelters. \n            This will make citizens learn more info about sheltered animals, and help citizens make more informed decisions when considering pet adoption. \n            ",
  "Dataset": "\n            We want to use the open source datasets from Austin Animal Center\n            https://data.austintexas.gov/browse?limitTo=datasets&q=pet \n            , which included animal intakes and outcomes record data, stray map, and affordable housing directory. \n            ",
  "Rationale": "\n            This project is going to mitigate high euthanasia rates, and help to enhance the well-being of both animals and communities.\n            ",
  "Approach": "\n            I plan on approaching this capstone through several steps:  \n\n            1. Extract sheltered animals data (2013 ~ 2023) from Austin Animal Center and integrate the related data and clean the data. \n            2. Conduct Exploratory Data Analysis (EDA) and especially Data Visualizations to learn and  understand the Animal Adoption pattern and Public Awareness.  \n            3. Develop Predictive Model(s) to predict if an animal will be adopted or euthanized. \n            4. Develop a Recommendation System to citizens who are interested in adopting pets if possible. \n            ",
  "Timeline": "\n            This a rough time line for this project:  \n        \n            - (1 weeks) Exploratory Data Analysis (EDA) and initial insights\n            - (2 weeks) Data Visualization (Dashboard maybe)\n            - (2 weeks) Feature Importance and Selection \n            - (3 weeks) Model Development and Training \n            - (2 weeks) Evaluation and Fine-tuning of Models\n            - (1 week) Compiling Results\n            - (1 week) Final Video Presentation\n            - (1 week) Writing up Paper and Final Submission\n            ",
  "Expected Number Students": "\n            For this project, we plan to have 3 students maximum to work on it.  \n            ",
  "Possible Issues": "\n            We may face 2 challenging situations during this project:\n            1. First challenge is the data preprocessing section, which are integrating or merging multiple relational data, \n               and then cleaning the integrated data; \n            2. Second challenge part maybe developing the recommendation system, because may not have enough relevant data.\n            ",
  "Proposed by": "Suzhe Li, Guoshan Yu",
  "Proposed by email": "suzhel@gwmail.gwu.edu, guoshanyu@gwmail.gwu.edu ",
  "instructor": "Professor Edwin Lo",
  "instructor_email": "edwinlo@gwu.edu",
  "github_repo": "https://github.com/Laisouchiu/DATS6501-Capstone"
}